# Bazel build system
tap "bazelbuild/tap"
# AWS
tap "aws/tap"


# Shell
brew "zsh"
brew "zsh-completions"
brew "bash-completion"

# Basic CLI tools
brew "coreutils"
brew "wget"
brew "gnupg"
brew "htop"
brew "tmux"

# Modern CLI utilities
brew "bat"
brew "exa"
brew "ripgrep"
brew "fzf"
brew "httpie"
brew "jq"

# Programming languages and tools
## Build tools
brew "bazelbuild/tap/bazel"
brew "bazelbuild/tap/ibazel"
## Version Control
brew "git"
brew "git-secrets"
brew "hub"
brew "gh"
## Others
brew "lcov"

# Cloud services
brew "awscli"
brew "aws-sam-cli"
brew "doctl"

# Diagrams and visualisation
brew "gnuplot"
brew "plantuml"
brew "graphviz"

# Spellcheck
brew "hunspell"
brew "languagetool"

# File types
brew "multimarkdown"
brew "p7zip"

# Terminal emulators
cask "alacritty"
cask "kitty"

# Accounting
brew "ledger"

# Window Manager
cask "amethyst"

# Fonts for Powerline
cask "font-droid-sans-mono-for-powerline"
cask "font-powerline-symbols"

# X Window System for Mac
cask "xquartz"


###
# Mac AppStore
###
brew "mas"

mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "XCode", id: 497799835

mas "MindNote", id: 1289197285

mas "Trello", id: 1278508951

mas "DxO OpticsPro for Photos", id: 1056077392
mas "Pixelmator", id: 407963104
